app/Controllers/Checkout.php

    public function pesanan()
{
    $username = $this->session->get('username');

    if (!$username) {
        return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
    }

    // Ambil data pelanggan untuk mendapatkan kode_pelanggan
    $pelanggan = $this->pelangganModel->where('username', $username)->first();

    if (!$pelanggan) {
        return redirect()->to('/login')->with('error', 'Pelanggan tidak ditemukan.');
    }

    $kode_pelanggan = $pelanggan['kode_pelanggan'];

    // Ambil data penjualan berdasarkan kode_pelanggan
    $penjualan = $this->penjualanModel->where('kode_pelanggan', $kode_pelanggan)->findAll();

    if (empty($penjualan)) {
        return redirect()->to('/keranjang')->with('error', 'Tidak ada pesanan ditemukan.');
    }

    // Ambil detail pesanan untuk setiap penjualan dan relasikan dengan tabel barang
    $dataPenjualan = [];
    foreach ($penjualan as $p) {
        // Ambil detail penjualan
        $detailPenjualan = $this->detailPenjualanModel
            ->select('detail_penjualan.*, barang.nama_brg, barang.ukuran')
            ->join('barang', 'barang.kode_brg = detail_penjualan.kode_brg')
            ->where('detail_penjualan.id_penjualan', $p['id_penjualan'])
            ->findAll();
---
SELECT *
FROM `pelanggan`
WHERE `username` = 'dapa'
 LIMIT 1
SELECT *
FROM `penjualan`
WHERE `kode_pelanggan` = '1'
SELECT `detail_penjualan`.*, `barang`.`nama_brg`, `barang`.`ukuran`
FROM `detail_penjualan`
JOIN `barang` ON `barang`.`kode_brg` = `detail_penjualan`.`kode_brg`
WHERE `detail_penjualan`.`id_penjualan` = '37'