app/Controllers/Home.php

SELECT `barang`.*, `kategori`.`nama_kategori`
FROM `barang`
JOIN `kategori` ON `kategori`.`kode_kategori` = `barang`.`kode_kategori`
WHERE `barang`.`status` = 'aktif'
AND `barang`.`kode_kategori` = '3'
SELECT `ukuran`
FROM `barang`
WHERE `status` = 'aktif'
GROUP BY `ukuran`
---
public function produk(): string
{
    // Ambil kategori dan ukuran yang dipilih dari parameter GET
    $kategoriDipilih = $this->request->getGet('kategori');
    $ukuranDipilih = $this->request->getGet('ukuran');

    // Query untuk mendapatkan produk berdasarkan kategori (jika ada)
    $barangQuery = $this->barangModel->select('barang.*, kategori.nama_kategori')
        ->join('kategori', 'kategori.kode_kategori = barang.kode_kategori')
        ->where('barang.status', 'aktif'); // Hanya produk dengan status aktif

    if ($kategoriDipilih) {
        $barangQuery->where('barang.kode_kategori', $kategoriDipilih);
    }

    if ($ukuranDipilih) {
        $barangQuery->where('barang.ukuran', $ukuranDipilih);
    }

    $barang = $barangQuery->findAll();

    // Mengelompokkan produk berdasarkan nama_brg
    $produkGrouped = [];
    foreach ($barang as $item) {
        $produkGrouped[$item['nama_brg']][] = $item; // Kelompokkan berdasarkan nama_brg
    }

    // Ambil ukuran unik dengan status aktif untuk filter
    $ukuranUnik = $this->barangModel->select('ukuran')
        ->where('status', 'aktif')
        ->groupBy('ukuran')
        ->findAll();

SELECT *
FROM `kategori`
---
    // Kirim data ke view
    $data = [
        'produkGrouped' => $produkGrouped,
        'kategori' => $this->kategoriModel->findAll(),