app/Controllers/Kategori.php

    public function index()
    {
        // Ambil data kategori dari database
        $data['kategori'] = $this->modelKategori->findAll();
---
SELECT *
FROM `kategori`