app/Controllers/Keranjang.php

SELECT `keranjang`.*, `barang`.`nama_brg`, `barang`.`foto_brg`, `barang`.`ukuran`, `barang`.`harga_brg`
FROM `keranjang`
JOIN `barang` ON `barang`.`kode_brg` = `keranjang`.`kode_brg`
WHERE `keranjang`.`username` = 'dapa'
---
    public function viewCart()
{
    $username = session('username'); // Ambil username dari sesi login

    if (!$username) {
        return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
    }

    // Ambil data keranjang dengan informasi produk terkait
    $keranjang = $this->keranjangModel
        ->select('keranjang.*, barang.nama_brg, barang.foto_brg, barang.ukuran, barang.harga_brg') // Menambahkan foto, ukuran, harga
        ->join('barang', 'barang.kode_brg = keranjang.kode_brg') // Join dengan tabel barang
        ->where('keranjang.username', $username)
        ->findAll();