app/Controllers/Pelanggan.php

    public function index()
    {
        $data = [
            'pelanggan' => $this->pelangganModel->findAll(),  // Ambil data list supplier dari model
        ];
---
SELECT *
FROM `pelanggan`