app/Controllers/User.php

private function checkUser()
{
    // Periksa apakah user sudah login
    if (!$this->session->get('isLoggedInUser')) {
        return redirect()->to('/login')->with('error', 'Anda harus login sebagai user.');
    }

    // Ambil data user yang sedang login
    $userModel = new ModelPelanggan();
    $user = $userModel->find($this->session->get('kode_pelanggan'));
---
SELECT *
FROM `pelanggan`
WHERE `pelanggan`.`kode_pelanggan` = '1'